[
{"title": "Thriving Thursday - January 4", "date": "Thursday, January 4, 2024", "text": "It is going to be a year of focusing on what brings happiness, comfort or good health to us or our family - and thriftiness on the everyday stuff plus making home maintenance easier! You already heard about our family New Year’s Day and the other couple of days were catch up and starting a couple of small projects.Happiness, Comfort and HealthSchool is out this week so we invited our son and older granddaughter for lunch and a visit tomorrow.My older son turned 53 yesterday so we caught up by phone.Having my last (for now) myofascial release chiropractor treatment this morning.Everyday Thriftiness- returned an item I decided not to use to organize the garage as I am trying not to spend money on that project- exchanged a new jar of peanut butter that had a broken seal and was leaking- put a chunk of money from our savings into a 1% higher interest rate 12 month CD- put a few Christmas ribbons and gift tags made from cards into a drawer to use for future- no food waste so farEasier Home UpkeepPut sand bags on the patio where it drains towards the house to prevent or at least reduce water intrusion into the crawl space during rainy season plus a couple in front of the sealed garage door Office and Garage Refresh ProjectsStarted weeding out the office file cabinet. The file cabinet needs to be replaced as the top drawer mechanism is breaking but I do try to go through many of the files once a year. The bottom drawer though is genealogy mostly and just sits there pretty packed.Decided that two 5 gallon paint containers left by the sellers in the garage laundry/storage room are unusable and will go to the hazardous waste disposal next week along with some pesticide containers. Still need to assess the smaller paint cans."},
{"title": "Well hello there 2024! I hope you will bring us many more good days", "date": "Monday, January 1, 2024", "text": "The new year started off quite happily for us as we spent the day with our son, DIL and 2 grandgirls. A belated Christmas gift exchange, delicious lunch and watching the Rose Bowl - Go Blue! The pup got to go too and be part of the pack to his delight."},
{"title": "Week 52: Saying goodbye to 2023 and being excited for a new year", "date": "Saturday, December 30, 2023", "text": "I am eager to turn towards 2024 and hope you are also looking forward to the possibilities of the coming year! Whew - we did so much in 2023. Bought and sold houses both with 30 day escrows. Moved from southern Cal to Northern Cal with a puppy using U-haul after giving away lots of stuff. Gave away lots more after the move. Had all the electrical, plumbing and termite damage identified in the home inspection fixed and also treated for termites. Replaced the sump pump and had the furnace hung to avoid further flooding damage. Did an earthquake retrofit and completely re-landscaped the yard front and back including adding new hardscape and trying to improve drainage to avoid future flooding in the crawl space.We celebrated with and hosted family and friends. Provided some child care and simply enjoyed our grandchildren and the ease of short visits with them, our son and DIL. Found the services and providers we needed. Learned our way around. Found our exercise routines and walked the dog many times a day which helped us meet people. We think we have met some potential good friends. Identified a few go to restaurants for take out. Explored a bit. Made an effort to stay connected to the friends and family we left behind and farther flung ones.We were at once stressed, tired, worried about the amount we were spending and delighted that we had moved to a nice home with nice neighbors and near our younger son and his family. We are so ready for an easier year full of joy and connections and less work LOL.Happy New Year and wishing that you get all you want from 2024!"},
{"title": "Frugal Friday: the year is almost over!", "date": "Friday, December 29, 2023", "text": "More little home improvements and repairs plus other little frugalities this week.1. After the first hard rain since we moved in we found a leak at one of the windows. Hubby was able to caulk the opening after it dried out. Another rain and it didn’t leak!2. The long piece of what I thought was metal threshold left in the garage turned out to be kitchen cabinet baseboard and end caps. The cabinet installation by the previous owner was a bit sloppy in places and there was no end cap in the most visible spot. Hubby cut one of the new pieces to fit and it is visually much better. We need a dab of glue to hold it though and will have to buy some.3. I was given loose tea from Portugal for Christmas and thought of using our French press to steep it as I have no teapot. Worked fine and the tea is quite nice.4.  🧝🎅🍪One of Santa’s elves left a bag of cookies on our porch Christmas Eve. I suspect the main elf is about 9 years old and lives up the street. Will be investigating the identity of the elves so we can thank them and let them know they are delicious.5. Prepared the forms to submit to get rebates on our federal employee health insurance since we have Medicare as primary."},
{"title": "Week 51: 2024 Hopes - Joy and Connections", "date": "Saturday, December 23, 2023", "text": "I do know this as 2024 is just around the corner -I want to make local friends and spend time with themI want to be healthier by making different habits routineI want to finish my old to do list - or throw it out I want to find a rhythm for spending time with local family that works for allI want to decide if I will travel to see my East coast family this summer and be happy with the decision I want to find at least one activity to do each week with people I really enjoyWhat are you considering for the new year?"},
{"title": "Frugal Friday - Almost Christmas edition", "date": "Friday, December 22, 2023", "text": "Some nice inputs to our little home economy -Our persistence paid off and we received a substantial refund of city real estate transfer tax paid for the home purchase! A small refund for our earthquake insurance for this year for some unknown reason.Our local realtor stopped by with a lovely gift of an interesting variety of olive oils. I see the company has lots of interesting recipes online for using them so we will be experimenting! It was the first time I met her in person as I only dealt with the house purchase virtually.And money saving actions -Continuing to work on running the dishwasher, washer and dryer during lowest rate times whenever possible. Turned down the temperature on the water heater some more to use less gas but still be comfortable.Only one takeout dinner, lunch date with Hubby and one coffee and treat out by myself. Rest of the time cooked and ate at home and had no food waste.Hubby used a plastic lid from an oatmeal container to extend a downspout to keep it from overshooting the underground drain pipe. Hopefully less water intrusion into the crawlspace as the underground drainage system seems to be operating wellI used plastic food container bottoms we already had to organize and protect the bathroom vanity drawers rather than buying drawer organizers."},
{"title": "Week 50: What to leave behind in 2024", "date": "Sunday, December 17, 2023", "text": "I was reading this blog post on Be More With Less 7 Heavy Things To Leave Behind and it really resonated.I am contemplating what I most need to leave behind as 2024 nears and think it is probably expectations and reticence. Not an easy thing to do.The opposite is true too of course as thinking about what you want to take with you into the new year is equally important. What would you find most valuable to leave behind as you head into a new year?"},
{"title": "Frugal Friday", "date": "Saturday, December 16, 2023", "text": "But first some spending for holiday fun!We bought tickets to the “6th Annual Merry Christmas from a Jewish Atheist Pianist” performance at a club in Berkeley on Christmas Eve. Sounds like it will be perfect for us and provide a dose of live holiday music.Fine Tuning the HouseWe continued to adjust our use of gas, electricity and water primarily for environmental reasons but also to minimize spending while staying comfortable. This house has a gas furnace, water heater and stove. Hubby continued to fine tune heating by getting a different style floor register for one spot and slightly adjusting the duct dampers ourselves. We also replaced a broken electric space heater as sometimes you just want to warm up the space where you are.He also worked on getting hot water in the shower without running a lot of cold first by adjusting the temperature mixer and then we were able to turn down the water heater temperature. I was pleasantly surprised to see on this month’s gas bill that we stayed in the lowest rate band despite using the furnace a lot. Although everything else is electric including 2 space heaters, we were successful in making the majority of our electricity use fall into the lowest rate time frame. Other frugal things1. Spent way too much time getting the lint off a king size fleece blanket that sheds when washed. I use it over the down comforter as the dog gets on the bed and it is nice and warm. I tried replacing it but sent two different new ones back for various reasons. So we have this one, a lint brush, my time and savings.2. Returned an item bought as a gift and used a box we had saved. After shipping it is only a partial refund but still worth it.3. Skipped a holiday gathering that felt more like an obligation than fun. It also required both a food contribution and a cash donation.4. Accepted some free tangerines and they were delicious."},
{"title": "Flowers mid-December", "date": "Thursday, December 14, 2023", "text": "This was left from the prior landscaping as was the one belowOne of my favorites so there is another in the front yardThe hummingbirds love this and it is placed to be seen from the kitchen window.A low spreader and delicate to fill some space in the frontA Camilla that will get 4 to 5 feet tall and welcome us to the front door. Also hummingbird friendly."},
{"title": "Frugal 5", "date": "Monday, December 11, 2023", "text": "1. Hubby installed sound barrier insulation near the furnace in the crawl space to help with noise when the furnace runs and we are sleeping. He also figured out how to adjust dampers in the ducts to get better heat distribution. This is our first winter in this house so being able to do this work really is appreciated.2. I made a dog pull toy out of a free baby receiving blanket. Pup is happy 🐶 as his previous one was pretty shredded and the rest of the blanket became rags.3. Incorporated quite a few small bits of food into meals rather than letting them sit in the freezer or frig. We are usually better about this but they were adding up.4. Borrowed a yoga block until I was sure the exercise requiring one was going to help my back. Then I bought the cheapest one I could find.5. I really want a new bathrobe but my current one still keeps me warm so I am resisting!"},
{"title": "Week 49: Fun and ferries", "date": "Sunday, December 10, 2023", "text": "We started the week off on Sunday by celebrating our DIL’s 40th at a winery tasting room brunch. It was fun and my DIL seemed very happy which is the most important thing💝Wednesday I had my weekly Pilates session and those are going very well.On Thursday a neighbor and I took the ferry from Point Richmond to San Francisco for lunch and a browse around the Ferry Building. We had lunch and I bought a small gift for Hubby. I enjoyed getting to know her a better. The ferry ride was short and very pleasant.Almost all Christmas gifts have arrived and been wrapped. Hubby put together the 3rd bench for the backyard. Between us we hauled two large cardboard boxes, old TV cables, and some random metal thingies to the recycling center. That cleared more out of the garage aka laundry and storage room."},
{"title": "Week 48: Miscellany", "date": "Sunday, December 3, 2023", "text": "I walked 39 miles this month with my phone in my pocket. Clearly I walked a lot more than that as I only carry my phone on actual outdoor walks. There were also lots of stair climbs with a two story house again.My back hurts less. Pilates sessions with a very good trainer is addressing the issue well. Much thanks to my son for finding this trainer who diagnoses and customizes extremely well. I like her as a person too.So much for reducing grocery costs in November: I thought we could keep our November grocery, household, toiletries and alcohol spending similar to October. I was way off. Having 2 more adults to feed for a week, Hubby’s birthday dinner party for 7, and providing significant hors d’oeuvres for Thanksgiving added almost $200 to our spending for the month. Happily spent I should add as the family time was lovely and fun. Today is my local DIL’s 40th birthday party so, although my older son is sick and stayed home, my DIl is back for 2 nights. They will be gone much of December and January visiting her parents which makes these visits all the more precious. We still have spent less in these categories this year than last and I have lowered the budget goal a bit further for 2024.Insurance costs and coverage: Once we decided not to switch insurance companies we took a close look at our homeowners, earthquake and excess liability policies. Raise a deductible here and get an earthquake retrofit discount there and it adds up. Plus we noticed the earthquake insurance still listed us as owning 2 homes (there was a few weeks overlap) instead of one and the homeowners insurance had not noted the recent roof replacement. Now I just have to go to city hall and get copies of all the permits for the property and hope there is one for updating water pipes!Speaking of city hall: I submitted the form and documentation to get part of our city transfer tax refunded because of the retrofit. This is enough money to care about.The county is slow: Still no word on our property tax credit for seniors who sold and bought a home in California. We are owed a discount on our property tax and submitted the form 7 months ago. To be fair, they did say it would take at least 6 months.Our 2 year old furnace is oversized: With colder weather we have discovered that the expensive furnace the sellers put in is about 50% oversized so it was shutting down because it got too hot. Hubby found an experienced technician knowledgeable about this brand and he was able to make an adjustment to the gas flow so it works ok and doesn’t overheat. Whew. We did not want to have to buy a new furnace.Planning for 2024: The new year definitely will see me focusing away from the house and yard. I’m starting to get excited about it!"},
{"title": "Our yard landscaping results", "date": "Tuesday, November 28, 2023", "text": "We tried to make it low maintenance and low water use as well as pretty, attractive to hummingbirds and butterflies plus dog friendly and deer resistant with nice places for humans to hang out! That was a lot of requirements plus we had to have decades of plants, old bricks and stone, yucky compost and up to 3 layers of weed barrier material removed. I’m not showing the pre-existing patio because it is bare at the moment since it is quite chilly these days.Eventually there will be tall shrubs providing a screen along the back fence plus the camellias and other plants blooming. The front yard is much more welcoming now and we like coming home to it."},
{"title": "Week 47: Fun and company", "date": "Sunday, November 26, 2023", "text": "Yesterday my 2 DILs, 2 granddaughters and I had a girls adventure by going to a holiday crafts fair held in a former shipbuilding facility next to the Rosie the Riveter Historic Site. It was a really fun afternoon.It was a great week with son and DIL here all week. 2 family birthday celebrations and Thanksgiving although I spent Friday feeling pretty tired as did the pup. Very worth it! Next Sunday we have another family birthday party and then are done until Christmas. The 9 month old granddaughter is crawling although her belly stays on the ground right now. She is fast on all the wood floors once she decides to move. I picked up a few toys for her age group from the Buy Nothing group. Also a bit of Christmas paper since I only need a small amount.We have declared our yard done for now and gave away the leftover flagstone to a couple with 3 sons and a puppy who were very excited to get it to cover a muddy section of their backyard. Just one more bench to put together and then nothing until summer except keeping the plants alive and replacing the free one that has died. Oh, and enjoying it!!!"},
{"title": "Happy Thanksgiving", "date": "Thursday, November 23, 2023", "text": "Hoping your day is what you wish it to be and that you go though it with a thankful heart."},
{"title": "Thankful: November 22", "date": "Wednesday, November 22, 2023", "text": "Today I am thankful for having had choices about how to live my life and for having had loving parents and grandparents.What are you thankful for today?"},
{"title": "Thankful: November 21", "date": "Tuesday, November 21, 2023", "text": "I met Hubby in graduate school decades ago. Today I am not only thankful for our life together but also for his turning 71 with no serious health problems and that we are celebrating his birthday with our sons, DILs and granddaughters.What are you thankful for today?"},
{"title": "Thankful: November 20", "date": "Monday, November 20, 2023", "text": "It was fun to see my older son playing with our pup this morning. They both had so much fun. I am thankful for these moments together.What are you thankful for today?"},
{"title": "Thankful: November 19", "date": "Sunday, November 19, 2023", "text": "Today I am thankful that my granddaughter felt very celebrated by her 7th birthday party.What are you thankful for?"},
{"title": "Week 46 & Thankful November 18: Family arrives for celebrations", "date": "Saturday, November 18, 2023", "text": "Instead of us making the drive from S Cal to the Bay Area for family events, now our older son and DIL do it. They arrive today and are staying a week for the much anticipated (by the birthday girl) 7th birthday party, Hubby’s 71st birthday dinner and Thanksgiving. It is a busy and filled with joy week ahead.  Then the following weekend we have local DIL’s 40th birthday bash and older pair is flying back for that. So thankful they all want us all together for holidays and milestones.What are you thankful for today?"},
{"title": "Thankful:  November 17", "date": "Friday, November 17, 2023", "text": "I am very thankful that Hubby only ended up with bruises and some pain when he tripped on the dog’s leash while crossing a street. He said he land on his hip and hand. What are you thankful for today?"},
{"title": "Thankful: November 16", "date": "Thursday, November 16, 2023", "text": "Today I am thankful that we live in a safe area.What are you thankful for?"},
{"title": "Thankful: November 15", "date": "Wednesday, November 15, 2023", "text": "Today I am thankful that our trash, recycling and green waste are picked up each week without fail.What are you thankful for."},
{"title": "Thankful: November 14", "date": "Tuesday, November 14, 2023", "text": "As much as I dislike cleaning house I am very thankful we are still physically able to do so.What are you thankful for today?"},
{"title": "Thankful: November 13", "date": "Monday, November 13, 2023", "text": "I am thankful that one neighbor seems interested in becoming my IRL friend. So far we are having nice chats and doing small things for each other. Have met a few other potential friends here too.What are you thankful for today?"},
{"title": "Week 45 & Thankful November 12: The joy of short visits", "date": "Sunday, November 12, 2023", "text": "One thing I hadn’t anticipated with this move is how great it is to have brief visits with my son and his family. For example, in this past week I have stopped by to pick up or drop off stuff and had lovely short chats and last Sunday my older granddaughter came home with me to have lunch and visit a short time. During the drive home and while she was here we had very interesting chats that are good windows onto what she thinks about and likes at almost 7. She and the pup had some snuggle time too which they both enjoyed. She is very busy on weekends with lessons and friend activities and understandably wants to spend time with her baby sister and Mom and Dad so long visits aren’t what she wants right now.Before we moved we had these short visits with our other son and DIL although the drive was an hour not 15 minutes. They now do the long drive and come stay with us for days which is also a great visit.What are you thankful for today?"},
{"title": "Thankful: November 11", "date": "Saturday, November 11, 2023", "text": "Today I am thankful for time with Hubby on a “date”. It was a beautiful fall day and we took BART across the Bay to have lunch at the Ferry Building in San Francisco. First time I have gone to SF since we moved!What are you thankful for today?"},
{"title": "Thankful: November 10", "date": "Friday, November 10, 2023", "text": "Today I am thankful for people who do the work we need done on our house and yard. They have reliably shown up and worked diligently while being friendly and nice.What are you thankful for today?"},
{"title": "Thankful: November 9", "date": "Thursday, November 9, 2023", "text": "Today I am thankful for knowing how to cook, sew and so much more thanks to my Mom and my childhood 4-H club program.What are you thankful for? Today I am thankful for clean water as so many people in the world can’t access it readily.What are you thankful for?"},
{"title": "Thankful: November 7", "date": "Tuesday, November 7, 2023", "text": "Today I am thankful that I am still able to drive safely.What are you thankful for?"},
{"title": "Thankful: November 6", "date": "Monday, November 6, 2023", "text": "Today I am thankful for public libraries and all the things they offer.What are you thankful for today?Decluttering and OrganizingAs the yard project keeps moving forward we are trying to use or give away the trash created before paying for a second and final dump haul. We took some leftover flagstone from the new patio and walkway as well as gravel that was pulled up and covered the dirt in a spot that gets a lot of water from a downspout. An interesting puzzle to put the pieces together to hopefully avoid a mud pit this winter I packed up the dog’s extra crate mats and the summer clothing I didn’t wear this year and stored them in bags under the bed instead of in the garage or closet respectively. If I don’t pull the clothes out next summer they can be given away. I am stressed by visual clutter so this is a good way to see if something is needed but not have to look at it.Repurposed a plastic storage container that was holding jewelry that I decluttered and am using it as battery and fuse storage. Much better than the falling apart box I was using.Being Active I spent part of Sunday at my son’s house helping a bit with 7th birthday party prep, chatting and watching the baby pull and roll herself around the living room. Gave the older one a book as an early birthday present and she plopped down and got right to reading it. She came home with me for lunch and a short visit.Went to an introductory Pilates session with the trainer my son likes and booked 4 more sessions for November. Repeat after me: I will get back in shape!Walked to the city rec center for the senior resource fair and got some helpful information. Everyone was so nice. This is a welcoming community.Signed up for a monthly mystery book club at the library. Will attend a meeting on the 15th and see if it is a place to meet my “tribe”.Had fun as usual with the goofy and loving pup.Home ProjectsThe retrofit passed final inspection so now to get city transfer tax rebate and insurance discount forms done and submitted. The plants are in their spots in the yard, drip irrigation set up and working plus most of the bark mulch spread. Our new lightweight hoses arrived too. Just a few more things to get done.I was able to give away all the rest of the dirt from digging holes to plant as well as the plastic pots the plants came in.SavingIn an odd series of events I was offered the same amount of money for a small antique Navajo rug that was given to my mother in the late 1930s as I spent on my new and very cozy down comforter. I wasn’t even trying to sell the rug but had decided it was time to pass it on."},
{"title": "Thankful: November 5", "date": "Sunday, November 5, 2023", "text": "Today I am thankful for being able to spend some one on one time with my older granddaughter.What are you thankful for?"},
{"title": "Thankful: November 4", "date": "Saturday, November 4, 2023", "text": "Today I am thankful for the butterflies visiting the plants we put in.What are you thankful for?"},
{"title": "Thankful: November 3", "date": "Friday, November 3, 2023", "text": "Today I am thankful that my body has the strength to do house and yard hard work.What are you thankful for?"},
{"title": "Thankful: November 2", "date": "Thursday, November 2, 2023", "text": "Today I am thankful for the nourishing and plentiful food available to me and my family. What are you thankful for?Today I am thankful for the gorgeous weather we had and being able to be outside to enjoy it.What are you thankful for?"},
{"title": "Week 43: October Update and November Goals", "date": "Sunday, October 29, 2023", "text": "OCTOBER ACCOMPLISHMENTS & FAILSReduce spending on food, household, toiletries and alcoholOctober total $787 vs $948 for September - yeah! I know we can do better.Complete major home projectsThe earthquake retrofit is done and the final inspection is on Tuesday. Then we will get the signed certification to submit for our insurance discount and also submit our request for a partial refund of our home purchase city transfer tax.The yard project is progressing. This coming week the rest of the plants go in, drip irrigation system is installed and bark mulch spread. Finish little tasksDid some decluttering, organizing and mending/alterations. More to go.Exercise regularly & moreDefinitely a fail. Even had to postpone my first Pilates session a week due to illness.NOVEMBER BIG GOALS- Pilates weekly, at home exercise at least 3 days, and long walks at least 3 days- Plan 2024 finances to replenish savings a bitWe have spent almost a year getting ready to move, moving and then doing the work on the new house. That has been a very costly and stressful. I am going to try to slowly add money back into our savings while learning what a normal year’s living expenses are here and focusing on other parts of life!- Keep grocer, household, toiletries and alcohol spending under $800 (2 guests for 7 to 10 days but not hosting Thanksgiving & will eat out some)- Low/No spending on household furnishings, clothing, coffee out, books, etc.- Clean up dust and dirt from completed projectsThe retrofit project unleashed lots of dust into our house probably coming in around the baseboards and ceiling fixtures the best we can figure. Every surface is dusty and it even is inside some kitchen drawers, etc. The yard project made all the screens and windows filthy on the outside too.I don’t expect to get it all done in one month but it really needs focused work and effort. I’ll look for decluttering and reorganizing options as I go. We did put open a new furnace filter once the work was done.- Visit one new place in area- Try at least one new social activity- Take pup on an outing- Spend time with granddaughter/local family at least once not counting Thanksgiving"},
{"title": "Week 42: Nephew visit &  yard nearly done", "date": "Sunday, October 22, 2023", "text": "Nephew visit: It has been over 10 years since we last saw him, his wife and older daughter. At that time they lived in Kenya and live in Taiwan now. We haven’t met his younger daughter and only he made the trip this time. It was great to catch up in person and he got to meet our son’s family for the first time.Home Improvement Projects: We are near the finish line with our yard project. This week lots of plants were put in the ground including the beautiful silver sheen in the corner. Our son and DIL gave it to us as it was already too large for their yard. We still need to select and purchase the smaller plants and get them in the ground. Then the drip irrigation will be set up and bark mulch put down.The yard is looking great and the pup is enjoying it both for running and sniffing. It is mostly an adult space, but future owners could easily convert some areas into play spaces by replacing gravel with real or artificial grass. We bought 3 of the benches in the top photo which are very comfortable. We will be getting a small black metal patio table back from our son and have some chairs and a patio umbrella. Also an outdoor rug that was left with the house. We ordered hoses for the front and back even though the plants will be on drip irrigation as there will still be uses for them.The railings for the old concrete patio stairs still need to be selected and installed. We are holding off on repainting the old patio until we see what it is like during the rainy season this winter after pressure washing.We have been diligent about returning any items we don’t use for the yard project within the return window, giving things away and patiently putting trash and green waste out each week to minimize our dump hauling cost. The dump haul won’t happen until we are sure no more waste will be generated by the project and we hope to share a load with a neighbor.Taking care of our stuff: I washed and put back together the dog’s favorite bed which will probably last another 6 months or so as he digs at it trying to bury his favorite toy and that is destroying the foam inside. It was a gift from former neighbors after their cat rejected it. We will look for a similar bed once it falls apart as he likes it so much.Discretionary expenses: I replaced our king size down comforter by purchasing one from The Company Store during their 30% off sale so the cost was $300. The king size one we have had for 6 years doesn’t have fill in some areas anymore as it seems to have migrated! Made for not so cozy nights. We really like the queen size one we purchased from The Company Store so I called and made sure I was buying the same weight. They were able to look it up even after 3 years.Food, household, toiletries & alcohol purchases: Very happy with our total three quarters of the way through the month. We did go out for pizza one night with our son and the baby which was a nice break  and our treat but is a separate part of our budget. We also had dinner at our son’s house the night our nephew visited which was our son’s treat.October week 3: $127.38 & Month to date: $437.06 vs $948 for all of September with one more week to go."},
{"title": "Earthquake Retrofit - The drilling, sawing and nailing begin", "date": "Friday, October 20, 2023", "text": "The earthquake retrofit, the final costly project, started today! We were a bit concerned it would be delayed when we learned earlier this week that they submitted the wrong info for the permit. The city came through with approval of the correct one quickly though and there was no delay. Once the work is done and approved we can apply for a partial refund of our city transfer tax but you only have a year from purchase to do that. We should also get a discount on our earthquake insurance.What is involved in an earthquake retrofit? For our home design it involves cripple wall bracing and foundation bolting. Our chimney would still likely fall down but addressing the chimney and its soft mortar is down the road as we don’t use the fireplace. The info below is from the California Earthquake Authority website. Cripple Wall BracingCripple walls are short walls that rest on a house’s foundation and support the floor and exterior walls. When these walls are not braced, they may shift during an earthquake. When this occurs, the chances of severe damage to your house and injury to individuals increases. Bracing cripple walls strengthens structures by increasing stability, and the process typically helps minimize damage to houses. See the image above to understand how new elements in the crawl space enhance the house's earthquake resistance.Foundation BoltingHouses that aren't bolted to their foundation can move during an earthquake. Houses that move off their foundation will cause significant damage and may be costly to repair. The bolting process requires that holes are drilled through the sill plate on a foundation and anchor bolts are installed. Sometimes, there isn't enough space to drill, and steel plates will also need to be attached. These bolts must be properly installed to be effective."},
{"title": "You can give away almost anything!", "date": "Tuesday, October 17, 2023", "text": "I continue to be amazed at what I can give away through my Buy Nothing group! The rock pictured above that we found upside down on our yard excavation and lots of fill dirt as advertised below although there is a lot more than shown.In Atlanta you got the same result simply by putting it on the curb. Do you live in an area that has a thriving giving and reuse ethic?"},
{"title": "Week 41: Rototilling, plant shopping and more", "date": "Sunday, October 15, 2023", "text": "We babysat both grand girls all day on Sunday so our son and DIL could go on a private boat excursion of the SF Bay. They won that adventure at a silent auction and had a marvelous time on a beautiful day. I'm so glad we could give that to them.The baby was cheerful and took two good long naps. The big grand girl was lovely to spend time with and had a birthday party to attend from mid-afternoon until after dinner. A nice but tiring day. The pup came over for a while and was also good but couldn't settle into his afternoon nap. He actually wanted to go home for a rest lol.The yard continued! The end is in sight. We agreed to a project price for the final phase. We bought soil amendment, edging, weed cloth, the major plants and 2 outdoor benches. Still to buy are the smaller plants, irrigation supplies and bark mulch. Planting began yesterday!Taking care of our stuff - This week it was a $142 filter for the fancy furnace. We don’t have AC so that is just a once a year purchase.Discretionary expenses - The socks I ordered last week arrived. I kept 2 packs identical to ones I am replacing and returned 4 of a different variety that weren’t what I expected. Also returned some jeans that didn’t fit and waterproofing shoe spray that required a different product to be used first. I do find shopping a pain🤪 but I did order a pair of smart wool socks from REI mostly using my member credit.Food, household, toiletries & alcohol purchases were higher this week as expected. I am hoping the pattern of lower and higher weeks continues low as we stock up and use things. That would cut our monthly expenses in this category significantly. All meals were all at home except Sunday when Hubby got take out for lunch and dinner as we babysat all day and were feeling our age! October week 2: $204.59 & Month to date: $309.68 vs $948 for all of September so we are doing better."},
{"title": "Yeah, last vaccine of the year done!", "date": "Friday, October 13, 2023", "text": "Update: Just tired and slightly scratchy throat this time - no chills or aches except slight discomfort at injection site. The nap did happen but then I couldn't sleep all night so wished I had pushed through instead.Got the current Moderna Covid vaccine today so that is the last of the triumvirate of RSV, flu and Covid needed this fall.Once again my immune system has quickly kicked in and I feel tired and have a scratchy throat. To nap or not to nap is the question right now. The pup has no doubts about which to do!"},
{"title": "Thrifty Thursday plus more decluttering", "date": "Thursday, October 12, 2023", "text": "ThriftinessI’m on a mission to get a head start on saving money in 2024 so I kept a list of my successes.- When our son and the grandgirls came over to lunch Monday, Hubby immediately suggested takeout. I thawed soup and we had that with tuna sandwiches and cut up veggies and apple slices. Everyone was happy and full.- Planned dinners for the week again and we only grocery shopped for what was needed but of course the total was more than last week as we had used up a lot of things.- I suggested to a neighbor that we combine our dump hauling needs from our yard renovations to try to save money and she thinks it is a great idea.- I received 2 plastic kid size bowls from Buy Nothing for future grandbaby use. Now I just need toddler size utensils and sippy cups as I received plastic plates earlier.- We enjoyed our gifted third of an apple 🥧 Decluttering- Making the hard decisions to get rid of mementos that I have no place for and that have been in my life forever. So far no regrets as my memories are still there but my house holds less. This week I gave away a wedding gift my parents received in 1945 and a picture I made in grade school that my Dad framed and hung in their last house (such an affirmation by my artistic Dad of my own abilities).- The person who wanted the pallets picked them up but left the crate sides. That is ok as there are other things that have to be hauled away.- When I reach for something to use I am asking myself if the items surrounding it are useful to us now or are they just taking up space. Some specialized sewing supplies were given away after I had to dig past them to get what I actually needed for mending."},
{"title": "Best Buy Nothing gift yet!", "date": "Tuesday, October 10, 2023", "text": "A third of an apple pie from a local restaurant bakery! I’ve had lunch at that restaurant twice and drooled over their pies in the case but with just the 2 of us it was too much. Today we will find out how good it is.Other gifts have been lovely and just what we needed though. I was delighted to use the high chair we were given so our baby granddaughter could join us at lunch yesterday. She was quite happy about it herself."},
{"title": "Week 40: Monitoring our spending & enjoying fall heatwave", "date": "Sunday, October 8, 2023", "text": "We are to trying to be really mindful of our spending the rest of this year and all of next year while finishing the repairs and improvements for this house and yard - and having fun and good family and friend time.The last 4 days of this week were quite warm (highs of 87 to 91) and with the new balcony door blind the house handled it pretty well. We are figuring out when to open which windows to cool down the house. I did run the heat to take the chill off the house on Tuesday morning before the heatwave arrived. Reprogramming the thermostat was successful although I may tweak the settings a bit as it gets colder here.Our property tax bill arrived. We knew it would be huge but seeing the number is another thing. Just a reinforcement to watch our other expenses. The county still has to apply another credit/adjustment related to the sale price of our previous house but that will be relatively small.Home/yard project expenses were only two inexpensive items for minor home improvements and one bag of topsoil. We both worked on the yard a lot to move things along and save money. Hoping to be ready to buy compost, plants and mulch this week.The hardscape is all done and paid for! We put two old patio chairs on the new back patio and are enjoying sitting in the shade.We are trying to get rid of the 2nd large batch of rubbish from the yard project without paying a lot for hauling. So far I posted 5 pallets and crate pieces on Buy Nothing and someone says they want them. Hoping they do take them. I also cleaned up most of a pile of old rock and will use a bit before posting the rest. We are going to try to sell the leftover flagstone pieces once we are sure we don’t need any of them. We have used a couple so far to help with drainage and stop erosion. Our trash can is small so the rest will be disposed of bit by bit over many weeks and by paying someone to do a dump haul.We received our free COVID tests and they are good until late January. I also got 2 boxes from the library that expire earlier so we are covered for now.We purchased a little food, a few household supplies, beer, and no toiletries. In September we spent over $948 on those items. Our food, household and toiletries pantries are well stocked so we should be able to spend less each month the rest of the year. Sadly I had to throw out a 4 pack of sea bass because it smelled and had obviously thawed and then refrozen. No other food waste.Total for October week 1: $104.77 - which is a good start to the month. Dinners were all at home.Pork chops  with chutney, sweet potato and zucchiniShrimp cocktails with large dinner salads and garlic breadRavioli with broccoli Turkey burgers on buns with sliced tomatoes and cooked spinachSalmon with broccoli and riceTurkey burgers on buns with sliced tomatoes, carrots and cornLentil and carrot soup with garlic bread , sliced pear and green salad"},
{"title": "October Goals - maybe they will be achieved!", "date": "Monday, October 2, 2023", "text": "Could I please just have a lovely vacation this month? No? Darn.Well if that isn’t happening then maybe these things will.Finish that darn move to do list.Get ready for my first session with new Pilates trainer by doing consistent mix of exercise video, upper body strength exercises and walking miles without the slow sniffing and pee on everything pup. He will still get all his walks.Alter 2 items of clothing, deep clean dishwasher, vacuum frig coils, clear off  the “ Do I want to keep it?” table in garage.Keep shopping (including food) to a low $ amount which requires planning meals detailed shopping lists, and determining emergency/back up food, pet supplies, toiletries and household consumables quantities.Finish yard purchases and get rid of yard Reno trash and excess materials.Then there are the things scheduled so far - watching older granddaughter at swim class and then lunch with family, full day of babysitting, my Covid shot, visit by nephew who lives in Taiwan, Pilates intro session, and AAUW monthly meeting."},
{"title": "Week 39: Hello October and big yard progress", "date": "Sunday, October 1, 2023", "text": "I took pictures of the backyard from the 2nd floor balcony and from the existing patio. Lots of progress. You can see where the plants will go and there will be a bench in the gravel area off the walk. More gravel and stones for the walk our front were delivered Friday. The end is in sight!The hard working landscapers, including Hubby, made huge progress though. It is kind of like a home painting project in the respect that you prep, prep some more, and then get to the nice part. There were more surprises in the destruction of the old front yard.Why put weed cloth, soil, black plastic, soil, more weed cloth, and then more soil down? We are astonished anything grew there!Why would you pile dirt against the bottom chimney bricks and mortar in a wet climate? It is not surprising the mortar needs repointing!Why were there old termite bait stations all over the yard yet there still was a termite problem? At least we have already addressed that with termite treatment that actually works.We are taking care of all of this and more but 😟I was busy all week but my to do list is pretty much unchanged although a couple of things did move forward. What did I do besides read and tend to the dog and house? I got my flu shot and as usual didn’t feel well for a short while. Two down (RSV and flu) and only Covid to go. I did the Trader Joe’s shopping this week and am enjoying pumpkin waffles. Of all the pumpkin items they had I only bought 2 boxes of those and some cans of pumpkin for baking.We got the earthquake retrofit work scheduled for the third week of October so that will be our last big new home expense until we get our updated retroactive property tax bill. The pup got groomed and had a great time doing so. I had some really nice chats with new acquaintances and came up with some storage space rearranging ideas that may help the house work better for us once I do them.Onward to the first week of October with a thankful heart and large bills still to come."},
{"title": "Thankful Thursday - end of September edition", "date": "Thursday, September 28, 2023", "text": "Hubby flew to Los Angeles midweek to attend the funeral of the husband of a close grad school friend of ours. Sadly that reminds us of what is really important and why we moved here to make memories with our loved ones. We are so fortunate to have this home near family and to be able to “suffer through” home renovations and there cost.I’m also thankful that:I was able to get my flu shot booked and done easily. I’m thankful for having meds on hand to deal with the side effects too.The availability nearby of a wide range of groceries and home supplies.Lovely sunny and warm weather these last few days.Seeing signs of Fall like the red leaf on the ground this morning.The nice people who stop and chat when I am walking the pup - most of them give him pets too which he loves.I’ve mentioned this before but I marveled again this morning at how quiet and peaceful our new neighborhood is all the time."},
{"title": "Week 38: Smoky air, progress and plans", "date": "Sunday, September 24, 2023", "text": "An unusual weekWow, we had two really bad air quality days followed by several hours of “unhealthy” air each day the rest of the week. It was smoke from wildfires in the far north of California and in southern Oregon. Then we found out our landscaper is injured and can't do the planting work. The person doing the hardscape work will step in thankfully and Hubby is pitching in as much as he can so this can be done. We agreed to a 10 hour day of babysitting both grand-girls in early October so son an DIL can go on a boat trip they won at a silent auction. Since the grand-baby burst into sobs when left with us briefly this week, we have concluded she has reached the stranger fear stage and we realized she had been asleep the last few times we were at their house. Ages in baby time since she was familiar with us being around lol. The plan is for me to spend big chunks of time at their house before babysitting so she is used to us again and we know her current schedule/likes/needs and how to use the high chair, etc. Babies change so fast at this age. As I told my 40 year old son, we haven’t taken care of a 7 month old baby since he was one!With lots of advice from the local Benjamin Moore store staff followed by internet reading, we have a tentative plan to fix the slippery paint on the large old concrete patio. Right now it seems the sequence is to pressure wash, lightly sand with an orbital sander, vacuum and wash again, perhaps prime depending on what the surface is like, and then paint with an anti-slip acrylic coating. The final coat can be made any of their colors so that is a plus. Our son lent us a handheld power orbital sander to test on a small area. Then we will decide how much of this to do ourselves as we could rent a larger orbital sander that you stand up to use and our landscaper will pressure wash. The store staff also carefully picked and recommended 3 small company painters for us to contact for bids if we want to hire a crew.Got stuff doneSon and the grand-girls came over for dinner Wednesday while DIL worked late. Cleared off my desk and that checked off at least 7 things on my 20+ items still on our move to do list and also got pile of paperwork filed.Cleaned the high chair so it is ready to useExercised a bit more and ate fairly healthily Bought 2 long sleeve tees after checking my wardrobe for fall. Decided to check out the local Marshalls before ordering anything else.We watched a video specific to our thermostat and reprogrammed it so fingers crossed it works correctly for us! No more coming on in the middle of the night when not needed hopefully.We agreed on the largest plants for back and front.Ate 6 of 7 planned dinners at home and got takeout from the local taco truck when son and girls were here.PLANS FOR WEEK 39Complete last week’s nagging tasks: finish cleaning the kitchen appliances that came with the house (refrigerator coils vacuumed, dishwasher cleaned)complete more items left on move to do listExercise more before flu shot on ThursdayPlan all meals at homeTry sanding painted concrete and decide how to proceed with painting after earthquake retrofit work is doneGet paint chips for colors used on house so can pick patio color easilyMending/alterations doneClear off “donate or undecided” items on table in garageRearrange non clothing storage so I have more room for clothing in my closet and bedside tableAnd that is once again ambitious!"},
{"title": "Planning week 38!", "date": "Monday, September 18, 2023", "text": "I’ve been feeling a bit down and lacking in motivation but accomplishing things always makes me feel better. Specifically I feel better when I exercise, can check things off the to do list or solve problems, eat fewer carbs, drink less caffeine or alcohol, and spend time with others. So let’s try those.Get stuff done -As usual I am overly optimistic about how much I will get done but that gives me options 😁1. Actually do my Pilates routine (I always mean to - really!). My sciatica is nagging at me and needs to stop.2. Plan time with family based on their schedule3. Get some nagging tasks done (clean off desk, clean out email by addressing old items,  hem pants, deal with remaining pile of items in garage by deciding to keep or get rid of, clean gifted high chair). 4. Finish deep cleaning the kitchen appliances that came with the house (refrigerator coils vacuumed, dishwasher cleaned/checked - stove & oven are done).5. Order 3 long sleeve tees, more warm socks, warm cardigan and/or fleece vest so I am not cold this winter.6. Substitute healthier choices for carb, etc. cravings or eating habits.Solve a problem or two -1. Why is the heat suddenly going on in the middle of the night? I found the thermostat manual online and now need to understand it so we can fix this before we actually need heat! I did turn the system off this morning but that won’t work long term.2. Decide on at least the main plants for the front and back. Find out where to buy them.Plan Some Dinner Ideas - We have found ourselves uninspired lately when contemplating what to have for dinner which is fine but not very enjoyable. We like simple, fast meal prep and see leftovers as a bonus so here are this week’s ideas. We’ll see what actually happens as we will get take out if we get together with the family).Green lentil and carrot soup - 2 mealsLeftover turkey burgers with carrots and peasShrimp with garlic, red pepper and broccoli over capellini Tuna chef saladChicken breast with butternut squash and green beansSalmon with mashed potatoes and saladWhat do you hope to do this week?"}
]