[
{"title": "XC Ski", "date": null, "text": "There have been many layers of stressors as of late and I'm so thankful the conditions are ideal for cross country skiing. A great way for me to have a mental break. I really enjoy winter, especially when we have a good blanket of snow. Both dogs go with me, but Holly is the one who sticks with me. Every chance I can get out here alone, I go.  A bonus when I catch the train (can you see it below)."},
{"title": "Zippy.  ", "date": null, "text": "Just a few shots of how we love Zippy so. The stray that showed up and decided to stay. He's not the most photogenic cat, but his personality is the sweetest."},
{"title": "Stitiching", "date": null, "text": "Although the plan of the day was not sewing, we did indeed sew.  Audra made 3 reversible bags.Then she started draw stringed bags, which I finished."},
{"title": "January Self Care", "date": null, "text": "January self care... Cozy up the home. Make a lot of good food.Get outside. I just love long walks.Make time for books and handwork.  I'm thankful to reminded by a sweet gesture from our church that I'm not alone."},
{"title": "Happy Birthday", "date": null, "text": "Happy 44th to my Hunk of Burning Who.  Whoopie pie cake, wings, garlic knots, rice a roni (he loves?!), cinnamon rolls, chocolates...all ingredients for the sort of birthday that makes him smile. Thankful to have him home for his birthday, although not for the reason he wanted.  Another brain injury, another round of symptoms, more appointments. He's had so many during his life, but he keeps on keeping on, hard as it is some days. Think of him as he tries to return to a part day of work tomorrow.  You bet your bottom dollar that I'll extend the birthday fun for more good food tomorrow. 100% the way to get him to smile is food.  Happy Birthday Justin!"},
{"title": "Moms Day Out", "date": null, "text": "I'm so blessed to have been able to do a Mom's Day out with friends. Truly, it was a perfect day. While I wasn't able to attend all the events of the day, I think I got the best of the best. I waited at the Library Book sale to hop on the train. We went thrifting and to Starbucks.  They went along with my (crazy) idea to bring them lunch at the Nubble (in 20 degree weather, nonetheless).  And before I returned home for our evening routine, I snuck a quick walk in Ogunquit (and only crossed one other person on my walk). Thank you, friends, for lifting my spirits."},
{"title": "Solace ", "date": null, "text": "I thank my dear readers for coming into this space and celebrating the joys I work to find in my day. Truth of the matter, there are a great many things in my life that aren't peachy and somedays I have to work really, really hard to look for the joy. On a day when nothing went as planned, I found great solace in my very own backyard under the moon.  What a gift it was that the train just happened to go by.  Tomorrow is a new day and I already decided it's going to be a great one."},
{"title": "Joy!", "date": null, "text": "Oh the joy when you beat your mom fair and square."},
{"title": "Reenactment ", "date": null, "text": "Audra had another round of reenactment.  She's getting more responsibility. She was responsible for the potato balls and the bread pudding on her own. I love watching her shine."},
{"title": "Another year around the sun", "date": null, "text": "Another year around the sun for me.  43, and I can't help but to think/grieve what my mom's life was like at the same age I was.  Her days were numbered and she was fully confined to a wheelchair at age 43. Sometimes I get really sad when my age parallels those memories and other times I feel really thankful that I have had so many more healthy days with my children than my mom ever had.  So what sorts of things were in these days around my birthday? I ditched my evening chores and painted something miniature instead.The ocean.We finished this book, which I love, love, love.We thrifted.  My haul for $6 :Books, Spanish CDs and scrabble quick challenge.I got myself flowers, the cake my grandmother always served, my family got me some chocolates, I opened some sweet birthday mail (Thank you!), enjoyed a surprise celebration with homeschool friends (Thank you!) and got a laugh out of the card from my dad...which he is still sending me my mom's cards (she died 27 years ago!).I'm not sure what I expected my life to look like at 43, but I'd say there are plants everywhere and definitely more roses than thorns."},
{"title": "Cross Country Skiing", "date": null, "text": "Cross country skiing is probably one of my most favorite sports and today's conditions were perfect. WHY DOES IT HAVE TO RAIN?  Rain is the forecast, for my birthday none the less, I wish we could just have more snow!  Regardless, we had an amazing day today. Anna-Kate did the most she ever did, made it around the whole loop. So proud of her!  Adrian chose snow shoes, the rest of us were on skis.  MORE of this, please! Somehow they let me take all the pictures today, so I did."},
{"title": "Audra is 11 and a HALF", "date": null, "text": "Audra is 11 and a HALF11, 10 and a HALF, TEN, Nine and a HALF, Nine, Eight and a HALF,   Eight,Seven and a HALF, Seven ,Six and a half, Six ,Five, 4 1/2,  Here's 4 , 3 1/2, 3 years, 2 1/2 years, 2 years 18 months,  12 months,  9 months?  6 months?  3 months?  Just being bornHappy 11 and a HALF, Audra Grace!There is no animal whisperer like you, Audra!  You can sooth, excite and pal around with any and all animals.  As of late, you've been doing your best to do your animal chores, which I know they appreciate.  When you have money, you buy treats for your animals.  However many animals we have is absolutely not enough in your mind. Not even close.  When you're a grown up, you'll absolutely have more. You thrive on routine but crave new things. A sticky place to be at times, but audiobooks help you out of these valleys along with your fave sports (swimming and ice skating lately).  You're also excited about the book series you're working through: Swallows and Amazons.  Crafting has always been your passion and you always have new things you're enjoying.  Lately it's the intricate color books, weaving, making gnomes and pompoms, diamond art and jewelry. You care deeply about your friends and people in general. You care what they think of you and work your hardest to be at your best when you're with them. You were elected president of our 4-H club by your peers, what an honor! Day to day life is hard, hard, hard for you, but you keep keeping on. Someday I hope you can look back and say 'I persevered and it is worth it!'.  I'm front and center for all accomplishments and will always be your biggest cheerleader.  Happy 11.5 Audra! Love, Mama"},
{"title": "Snow", "date": null, "text": "We had our first 'more than a dusting' snowstorm of the year. Oddly I wasn't involved much with snow removal. That's because we have Adrian. He's seriously the world's best shoveler. Justin did the snowblower, but I took no photos to prove it. Audra spent some time outdoors.And then mass produced these. Anna-Kate was served snacks as she played outside. She also did some sledding.She certainly got her wish for snow, but it's definitely not snowman snow.I did some housework and rearranging. And made  A LOT of food. Trying to use what we have put away and what we've been gifted. I made a double batch of corn chowder, processed a homegrown hubbard squash, made a stew, two loaves of bread, two carrot cakes (one for the freezer) and cream cheese frosting and BLTs.  At the end of the day, it seems like there's not much left to show my efforts, as we're feeding a shoveling teenager now. I think one of the most favorite parts of living in Maine is days like today when we're stuck at home. We had time for good food, playing outside, a movie, board games and read alouds.  We had two fires going inside, so it was nice and toasty all day.  When it was bed time, we changed out of yesterday's pajamas into fresh pajamas. 10 out of 10!"},
{"title": "Bruins Hoodie", "date": null, "text": "Adrian is a Bruins fan and has many T Shirts.  He recently (after Christmas) said that he wished he had some long sleeved Bruins apparel, his fave pics to the tune of $50 to $100. Enter his crafty mom.  A quick trip to the thrift store yielded possibilities!  I picked up this $3.00 like new Gap insulated Hoodie and a well worn Boston Bruins T shift for $2.00.  For a grand total of $5.00, he has a Bruins Hoodie that he loves. Before:The After:  He's thrilled!"},
{"title": "Lighthouse Crawl #2", "date": null, "text": "Part 2 of the lighthouse crawl, part 1 here.These are the lighthouses we can see from the Maine coast from our house south, with the art work we did. NubblePortsmouth HarborWhalebackTo end, we had a picnic. My husband and I were introduced because of Stonewall Kitchen. I was thinking my kids haven't had any of the jam because I make all of our jam homemade/homegrown and have basically done that for their whole lives.  We bought a sampler pack and I made different PBJs so they could sample them all.  Adrian liked Holiday Jam best.  Anna-Kate liked the Wild Maine Blueberry. The rest of us liked the Raspberry Peach best.  So this wraps up our lighthouse series, onto the next thing!"},
{"title": "Lighthouse Crawl, Day 1", "date": null, "text": "As mentioned in this post, I did a month long series of light house art with a bunch of kids.  I was aiming for our kids to know the lighthouse we can see from land. This post takes you from our home, up to 30 miles north. These are the lighthouses we can see on land and the art we did. Portland Head  (It was really rainy)Wood IslandGoat Island Stay tuned, tomorrow will be lighthouses south of us."},
{"title": "Lighthouse Art", "date": null, "text": "I led a five week series entitled Lighthouse Art.  Kids were to pick a lighthouse and learn about it, map it and then choose one of the art techniques to create their own. Watercolor, paper collage, pastels, dots, pen and ink or silhouette were options.  My kids enjoyed it.  Here are our finished projects. Stay tuned!  We did a lighthouse crawl and visited all these.  Hopefully tomorrow I'll be able to post what we did."},
{"title": "Best of 2023", "date": null, "text": "Growing Lipsky Winter 2023SpringSummerFallOnto another year of memories in 2024. Happy New Year!"},
{"title": "Christmas 2023 Recap", "date": null, "text": "Audra made this for Anna-Kate, a joke between them. (We gave each other the same gift...unplanned.  Winter headbands.)\"Santa knows what's up. From one big guy to another, DOMINOS!\" Their Loot (not just from us, from other loved ones too..thank you!)Adrian's gift to me was a walk just the two of us.My fireside reading afternoon.Everyone was quick to sleep after such a lovely day."},
{"title": "Christmas Prep", "date": null, "text": "December was busy. Really busy.  I posted recently all the service we did.  With all that service, I hardly had the bandwidth to decorate as usual.  We did bare bones.  Basically a tree, stockings and some tiny things and that's it.  Kids watched a couple of movies.  We did a little baking and a bit of crafting. We did read Christmas books. Not as much as I had planned. I got behind in blogging and way behind in housework. It's easy for me to get wrapped up on what I did not accomplish. It's an ongoing battle, focusing on what I did do instead of what I didn't.   BUT, what we DID do is lots of things for others...and isn't that the point? Here are a few moments that brought me joy."},
{"title": "Mama Made: A dress fit for a queen", "date": null, "text": "And pics of the rest of us...are we her royal court or servants?  Depends on the minute."},
{"title": "Mama Made PJs Christmas 2023", "date": null, "text": "Another year, another round of Mama Made Pjs.  Everyone is still excited to get them!  Most of the fabric is from a $5 king sized flannel flat sheet I found at the thrift shop.  Plus there is some fabric I got at the library's fabric swap.  I purchased the navy blue shirts I appliqued.  I spent $12 total for all the tops and bottoms."},
{"title": "Merry Christmas 2023!", "date": null, "text": "If I was the type that was good at everything, one of these photos would have been printed and sent in a delightful card.  Someday I'll send folks a stack of cards with the photos from the last decade.  Until then, you can get merriment from us here.  Merry Christmas!"},
{"title": "11th Annual Country Kids on Winter Solstice ", "date": null, "text": "Thank you to our good friends, we had a jolly good time at our annual Country Kids party!  Thanks to our generous friends we have a whole bunch of crafts and play doh to share with our local special needs school (the non for profit my kids selected this year).  I never take enough pics, but here are a few! Smart people would buy cookies for a cookie eating competition, but I made them instead last night. It's been a BUSY month! Looking forward to a bit less (hopefully) and working through our family read aloud pile the next week and a half.  Just a couple more days of busy to go! While we didn't go to the ocean during this last storm (that put a lot of Maine out of power for days, some still aren't restored, thankful we were only ~24 hours without power), we did go before and after.  Amazing to see the photos juxtaposed. I feel the photos don't even do it justice.  It was WILD."},
{"title": "Month of Service", "date": null, "text": "We make December our Month of Service and I want to document this year's service timeline so I remember for next year.  Do we have time for all this?  No.  But putting serving as the priority and leaving other things that are less important (housework) helps our family keep focused on the reason for the season. Let's see if I remember: 1) Festival of Fostering Trees: we donated the tree and ornaments and one of our fantastic 4-Hers set it up.  This reportedly raised almost $60,000 for youth aging out of Foster Care. 2) We did a winter gear swap for a week and a half and the leftover coats went to a coat drive. 3) We collected with local churches and the big kids help wrap and package food items for the food pantry. 4) Thanks our neighbor's tree farm(they let us trim away anything folks left and collect scraps), we prepped and hosted an evergreen centerpiece arrangement session and made over 75 arrangements.  We, along with 4-Hers and then community members distributed to various 'helpers' or people who could use some cheer.  We also made DIY kits and opened up our home for a make your own centerpiece arrangements to share.  We had several who participated in that.  5) We then packaged the remaining greenery and distributed 3 different types of greens to three different nursing homes, along with DIY packets so they could make centerpieces.  Before Covid, we used to do this with the residents, but now we just drop off. 6) We made and gave presents to a family our church adopted and then participated in the wrapping party to wrap all those gifts. 7) I've planned and hosted Friday Lighthouse Art and Boardgames at the library. 8) We were wrappers at the Kids Shop event at our local thrift store.   I loved watching the kids pick out their perfect selections for their loved ones. Oh, to be a fly on the wall Christmas morning with some of the unique purchases! 9) Our BIG Country Kids party at our house on Thursday/Winter Solstice. We'll be collecting donations for the special needs preschool in our area (craft supplies and monetary) and have a very festive time.  Everyone is invited, so do come!  10) Our family has some speaking parts in the Christmas Eve service at our church. 11) Usually around Christmas or after, our family tries to make a big batch of bread or biscuits to share with the neighbors. I think I got them all! It has been a BUSY month of serving, thankful for the opportunity to be a helper. Hopefully we spread some Christmas Cheer!"},
{"title": "Christmas books", "date": null, "text": "Pulling the Christmas books back out is like being reunited with long lost friends.  We always have a mound of picture books, a hymn we're memorizing and a couple of Christmas chapter books we read during the month.  (This year we re-read Tree for Peter by Kate Seredy and we're going to do This Way to Christmas by Ruth Sawyer next week).  We also are reading about Christmas traditions around the world. What a joyous time to gather fireside to savor the richness of the season."},
{"title": "Merriment ", "date": null, "text": "A bit of merriment here and there, taking things slow in aim of keeping things from getting too wound up.  Sometimes the excitement that comes from this time of year gets a wee bit overwhelming. I aim to balance with a lot of service projects with some merry making in between.  A few highlights: We got our redneck...errr....whimsical tree.(along with other greens for our holiday centerpiece service activity)I snagged a falling apart tatting table runner this summer. I cut them apart, starched them and now have gorgeous handmade ornaments. Tree isn't very decorated yet, but these are up.Adrian has been painting. Audra has been crafting.Today we went to a Celtic concert with Christmas music and Anna-Kate got to see the big guy at a library Christmas party. More merriment to come!"},
{"title": "Holiday Centerpieces", "date": null, "text": "Looking for local service project helpers!  Every year our 4-H club makes these festive centerpieces and we work on distributing them to anyone who is a helper or someone who could use some cheering up.  We have extras this year (yay!) and we're hoping to extend some cheer beyond our immediate circle. Do you know someone who is making a difference?  Or someone who could use a smile?  Or if not, would your kids be willing to deliver to your doctor's office, police station, fire station or town hall?  You're invited to either:  a) Pick up one of these premade arrangements and deliver.. OR b) Bring a jar, grab some greens at our house, I'll leave out kits and you can make your own.  It's a FREE way for you to serve this week! PM me to participate.Location of the merriment!"},
{"title": "Cabinet of Curiousities", "date": null, "text": "I moved out the china into our built in and filled this with some of our nature treasures.  A friend called it a cabinet of curiosities.  Fitting."},
{"title": "To BOG's", "date": null, "text": "While we did not make it to my dad's for Thanksgiving because of weather, I took the kids myself and went after thanksgiving. Left my poor husband alone in Maine.We had Thanksgiving (again) with him.  He grew or harvested allll of this. We had R&R with MaryAnd we got to see a bunch of extended family (I never remember to take pics when talking!)We had riveting games. Made some good food. Lots of nature. And BOG worked the big kids in the woods for hours.Audra and I crafted.  Audra's been weaving and I finished Christmas PJs for the kids (pics forthcoming). We also surprised my dad with functional modern gadgets that he definitely doesn't need, apparently. It was nice to have a wee bit of R&R at my dad's."},
{"title": "Thrifted", "date": null, "text": "Two different stops, two different scores. Apparently folks are cleaning out their games.Another game of Headbanz that was brand new, not even out of the plastic (which this is a GREAT group game, I use it all the time), a Haba cooperative game that I love, Ticket to Ride First Journey and four buckets for our beachcombing 4-H club.  $4. Magnetic poetry, Nature's Bingo, Where in the World (looks like a vintage map game), America Monopoly and a 300 piece snap circuit, with all the pieces in the plastic.  I keep collecting them, we have quite a big bin of them.  Total:  $6."},
{"title": "Wander and Wonder Underground", "date": null, "text": "Those who know me, know how I groove. Our family is really involved in Cooperative Extension. Each month with Cooperative Extension looks like: * Leading Nature Kids 4-H Club* Leading Beachcombers 4-H Club* Spearheading Extension Modern Day Homemakers for adults, we meet 1-2x a month * Working on my Master Gardener Volunteer Hours* Serving as Vice President of the 4-H Leadership  Team* Serving on the YCEA (York Cooperative Extension Association Board) (every other month)* And I work on special projects and lead a specific focused workshop series every month.    I'm working on keeping better track of what I lead.  Here are the monthly ones I've done since 9/22.  Wander and Wonder BeachOld Fashioned Club MakersWander and Wonder in the Woods: Rodents  Dabble and Babble: Art with Lines Science Lab in the Supermarket Sewing Club Wander and Wonder Tails, Teeth and Tracks4-H Magicians Traveling Performance ShowWander and Wonder Beach: Our Coastal Feathered Friends Wander and Wonder River BirdsWander and Wonder Beach: Crustaceans Papermaking with Nursing Home Residents Science Lab Extravaganza Wander and Wonder Underground Maine Lighthouse ArtWander and Wonder Underground was a 4 week games, science and art series that wrapped up. Here are a few snapshots of our time."},
{"title": "Winter Gear Swap", "date": null, "text": "For the next week and a half, we're running a winter gear swap out of our porch. This isn't needs based, it's for everyone. Community helping community. If you're local, you can drop off and/or come take for the next  week or so."},
{"title": "Popsicle stick frames", "date": null, "text": "Audra has been making popsicle stick frames to showcase her photography.  Of our animals, of course. She got going the other day and made a dozen. I love when she gets excited about something.  They are mighty lovely too."},
{"title": "Memories", "date": null, "text": "Long time friends had some treasures to share (thanks Rosemarie and Dave!).  We made this little basket to share and I took no pictures when we were there (oops). This was my first non-campus apartment and where I met my husband, as well as many friends we sitll keep in contact with today. I loved swimming, kayaking/canoeing, ice skating and cross country skiing on this little river.  I loved having wildlife right outside the window, especially the pair of swans and the beaver. It's just as gorgeous as I remember.  Wonderful memories."},
{"title": "Thanksgiving re-cap", "date": null, "text": "We made the executive decision to not travel through weather for Thanksgiving and just eat at home.  With the exception of it being too late to thaw a turkey (which we have several in the freezer), everything else I not only had at home, but most everything I grew! I'm pretty proud of the fact I was able to throw a feast together without going to the store. My own potatoes and turnup mashed with garlic butter I made.  Homegrown squash with syrup from our Amish friend. Tabouleh with the parsley, green onions, mint and garlic I grew. Cranberries from the Maine cranberries I picked with the kids.  And stovetop stuffing I had on hand and chicken I had marinated and frozen enough when they were on sale a few weeks ago. Then I made apple pie with apples we picked. And we had apple juice I made from said apples too. I had homemade rolls that I made and froze, but forgot to pull.  Plus homemade whipped cream. Not a traditional thanksgiving, but a Thanksgiving to remember.  He's winking here.Then we had a wonderful time walking off our feast in our backyard.And Thanksgiving ended with the BEST grand finale. Audra gave me these lists she wrote on her own.  Best gift ever!"},
{"title": "Thanksgiving 2023", "date": null, "text": "Thankful for my party of five and how we've all flexed successfully with our last minute change of plans due to New England weather.  Staying home for Thanksgiving instead of getting caught in an ice storm. Gobble gobble, the biggest turkeys in Maine are pictured below."},
{"title": "Homemaker Love", "date": null, "text": "Years ago I started an Extension Homemaker group, envisioning that there were more crazy homemaker/homesteaders like me who wanted to be a community.  I'm not going to lie, it was NOT an easy thing to start.  BUT, years and years later, it was 100% worth it!  We have an amazing community of women helping women. We share our seeds, plants and produce. We help one another, we support and encourage one another.  We do monthly classes, teaching each other. We also have work days helping each other. Here's a pic of our stone soup meeting.  Everyone contributed things they grew and we combined it into a soup.  SO GOOD. Because I'm the best at helping and the worst at asking for help, I was reminded several times that I needed to schedule a work meeting at my house. Finally did and am thankful for the help I had mulching my ridiculously large for a family of 5 orchard. This was my before Thanksgiving garden list. With homemaker help, the only thing left was digging potatoes.Which we did today.  Now although I hurt my shoulder and can barely move my arm, I am smiling because my before Thanksgiving garden list is DONE."},
{"title": "The Gold at the End of the Rainbow", "date": null, "text": "My husband ran in hollering for me to \"Get out, get out!\"  Quickly learned why.  The gold at the end of the rainbow is my beloved farmhouse. I knew it! Look closely and you'll see my other treasures, my crew is posing.All five of us."},
{"title": "Wrapping up day", "date": null, "text": "It's the week of wrapping up! Our semester of homeschool co-op wrapped up. Adrian had Global Studies, Jr. Police Academy and Maine StudiesAudra had Book Club, Herbal First Aid and Survival SkillsAnna-Kate also had bookclub, gym and Hooray for Habitats. I was the lead teacher for Hooray for Habitats with 1st and 2nd and Bookclub with 1st, 2nd, 5th and 6thI surprised Adrian with a delightful necklace I wore during presentation day.  He was thrilled, lol. We celebrated with a Kittery Trading post visit.And the big kids wrapped up archery. Phew! What a day."},
{"title": "Fallfest", "date": null, "text": "4-H Fallfest 2023.  I brought my staple basket of warm applesauce to add to the pizza party. I took hardly any pics, but I coordinated Makers and Builders and button crafts.  Adrian coordinated the games. Audra attended a trapping workshop, did a lot of jewelry making, soap making and I think something else. Anna-Kate made her evergreen centerpiece, made bath bombs and did some painting. I took no pics other than these two of my kids, signs of a great time."},
{"title": "First Snow", "date": null, "text": "We had our first snow a week ago. I'm a bit behind the times in posting. I just love our home under a blanket of snow.Adrian spent his morning shoveling, Audra was with the chickens and Anna-Kate running around barefoot in her Pjs and mama made dress. Zippy prefers inside, but the dogs love a romp.I did the regular thing I do when it snows. Make a lot of food."},
{"title": "Reenactment ", "date": null, "text": "Another round of reenacting for Audra, with me trying to keep AK busy..."},
{"title": "Flowers", "date": null, "text": "My flower girl and I are mourning the end of the flowers.  We have one tiny arrangement still in bloom on the counter.  I love seasons, but definitely grieve the end of having Maine grown flowers on the table."},
{"title": "4-H Public Speaking", "date": null, "text": "I grew up in 4-H and the club I was involved in was big into public speaking.  I'm so proud to say that my trio are great public speakers and everytime they get up in front of others, I'm impressed with their comfort level. This was a Like, Don't like and Change challenge."},
{"title": "October Dips", "date": null, "text": "I started a beachcombing club and it's quite a delightful way to spend one's time.  There were a number of October adventures that ended up with a fully soaked Anna-Kate.  Born and raised Mainer, she is."},
{"title": "The Story of the Hydrangeas ", "date": null, "text": "Last year there was an ad on facebook marketplace for free 'you dig' hydrangeas.  I went, I dug and I pulled out a chunk of gardens and added them. I had visions for more.  One year later, there's a different facebook ad for hydrangeas. I decided to bring Adrian.  Adrian is NOT into my gardening ideas, but I told him he didn't want to send me to a creepy stranger's alone.  He groaned, but came. When we arrived, he said \"NO. Mom.  We are not doing this.\"  It was HUGE.  I was thrilled!!  It took a looooong time, but I dug it up.  With him watching (because he foolishly wore crocs) and telling me I was ridiculous. BUT I DID IT.  And then I remembered I just had our little subaru.  BUT I WAS LEAVING NOTHING BEHIND. Long story short, I got them all in what will eventually be a hedge of hydrangeas and I'm so happy!"},
{"title": "Zippy", "date": null, "text": "3 different rooms.  3 different kids.  Zippy makes the rounds."},
{"title": "Happy Halloween 2023", "date": null, "text": "Found in our home costumes this year: Marty from Back to the Future.  Mary Poppins and a Talkative Pirate. I used to make all the things for Halloween, but I am really embracing their own creative ideas now (AKA: I didn't sew the things they wanted me to).As per usual, we use Halloween day as a day of service. We gleaned apples again at a generous orchard.  I think we personally picked over 400 lbs., much of it is designated for homeschoolers.  Below is about 1/3 of what we picked.  My kids have put in several hours gleaning over the month.I have one who does the lifting and organizing. Always ready to carry the heavy loads so others don't have to. I have one on tiptoes up in the tree reaching the tip top apples. This one is going to get so many apples in the bag it might burst. I have one keeping everyone company, eating apples, talking up a storm. This one has one apple in the picking bag after a solid hour of picking.  I have three who are truly united when we serve together."}
]